app/controllers/blog_post_controller.rb

    def index
        @blogs = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

    def show
        @blog = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]